# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [1]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [14]:
df = pd.read_csv('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
# Can also use read_table with ',' as a delimiter
df = pd.read_csv('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/example' ,sep=',')

#Show
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
#If we dont want the header to be the first row
df = pd.read_csv('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/example' , header= None)

#Show
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [22]:
# We can also indicate a particular number of rows to be read

df = pd.read_csv('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/example' , header= None , nrows = 2)

#Show
df

   0  1  2  3
0  a  b  c  d
1  0  1  2  3

In [23]:
# lets read the dataframe once again
df = pd.read_csv('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [24]:
df.to_csv('example_output_false_index.csv',index=False)

In [25]:
df_example_output_false_index = pd.read_csv('example_output_false_index.csv')
df_example_output_false_index

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
df.to_csv('example_output_true_index.csv')

In [27]:
df_example_output_true_index = pd.read_csv('example_output_true_index.csv')
df_example_output_true_index

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [28]:
#  We can also use other delimiters

#we'll import sys to see the output
import sys 

#Use sys.stdout to see the output directly and not save it
df.to_csv(sys.stdout,sep='_')

_a_b_c_d
0_0_1_2_3
1_4_5_6_7
2_8_9_10_11
3_12_13_14_15

In [29]:
# Just to make sure we understand the delimiter
df.to_csv(sys.stdout,sep='?')

?a?b?c?d
0?0?1?2?3
1?4?5?6?7
2?8?9?10?11
3?12?13?14?15

In [32]:
#We can also choose to write only a specific subset of columns
df.to_csv(sys.stdout,columns=['a', 'b' , 'c'])

,a,b,c
0,0,1,2
1,4,5,6
2,8,9,10
3,12,13,14


You should also check out pythons built-in csv reader and writer for more info:
# https://docs.python.org/2/library/csv.html
---

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [34]:
pd.read_excel('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [35]:
df.to_excel('Excel_Sample_output.xlsx',sheet_name='Sheet1')

In [36]:
"""
IMPORTANT NOTE: NEED TO HAVE xlrd AND openpyxl INSTALLED!!!
"""

'\nIMPORTANT NOTE: NEED TO HAVE xlrd AND openpyxl INSTALLED!!!\n'

In [40]:
# Open the excel file as an object
xlsfile = pd.ExcelFile('/content/drive/My Drive/Goal - Data Science/DS/Python-DS-ML/03-Python-for-Data-Analysis-Pandas/Excel_Sample.xlsx')

In [41]:
# Parse the first sheet of the excel file and set as DataFrame
dframe = xlsfile.parse('Sheet1')
dframe

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [52]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'
#df = pd.read_html(url)
df = pd.io.html.read_html(url)
type(df)

list

In [53]:
len(df)

1

In [61]:
dframe = df[0]
dframe

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]

____


# SQL

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [58]:
from sqlalchemy import create_engine

In [59]:
engine = create_engine('sqlite:///:memory:')

In [62]:
dframe

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]

In [63]:
dframe.to_sql('my_table', engine)

In [64]:
sql_df = pd.read_sql('my_table',con=engine)

In [65]:
sql_df

     index  ...       Closing Date
0        0  ...      April 3, 2020
1        1  ...  February 14, 2020
2        2  ...   November 1, 2019
3        3  ...   October 25, 2019
4        4  ...   October 25, 2019
..     ...  ...                ...
556    556  ...      July 27, 2001
557    557  ...        May 3, 2001
558    558  ...   February 2, 2001
559    559  ...  December 14, 2000
560    560  ...   October 13, 2000

[561 rows x 7 columns]

# JSON

In [73]:
# Heres an example of what a JSON (JavaScript Object Notation) looks like:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

type(json_obj)

str

In [74]:
#Let import json module
import json

#Lets load json data
data = json.loads(json_obj)
type(data)

dict

In [75]:
#Show
data

{'clothes': None,
 'diet': [{'food': 'grass', 'fur': 'Brown', 'zoo_animal': 'Gazelle'}],
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'zoo_animal': 'Lion'}

In [78]:
#WE can also convert back to JSON
j = json.dumps(data)
j

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [79]:
type(j)

str

In [81]:
#We can simply open JSON data after loading with a DataFrame
df = pd.DataFrame(data['diet'])
df

  zoo_animal   food    fur
0    Gazelle  grass  Brown